In [1]:
import pandas as pd
import os
from itertools import permutations, combinations

# Merge all files

In [ ]:
files = [file for file in os.listdir('../../projects/Sales-Project')]
df = pd.DataFrame()
print(files)
for file in files:
    if file.endswith("csv"):
        df2 = pd.read_csv('../../projects/Sales-Project/'+ file)
        df = pd.concat([df,df2])

# Display dataset

In [7]:
df.head() # Head

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [8]:
df.tail()  # Tail

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
11681,259353,AAA Batteries (4-pack),3,2.99,09/17/19 20:56,"840 Highland St, Los Angeles, CA 90001"
11682,259354,iPhone,1,700,09/01/19 16:00,"216 Dogwood St, San Francisco, CA 94016"
11683,259355,iPhone,1,700,09/23/19 07:39,"220 12th St, San Francisco, CA 94016"
11684,259356,34in Ultrawide Monitor,1,379.99,09/19/19 17:30,"511 Forest St, San Francisco, CA 94016"
11685,259357,USB-C Charging Cable,1,11.95,09/30/19 00:18,"250 Meadow St, San Francisco, CA 94016"

In [9]:
df.info()  # data info

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186850 entries, 0 to 11685
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
dtypes: object(6)
memory usage: 10.0+ MB

In [10]:
# Getting unique values from each category
df[['Order ID', 'Product', 'Quantity Ordered', 'Price Each', 'Order Date', 'Purchase Address']].describe()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
count,186305,186305,186305,186305,186305,186305
unique,178438,20,10,24,142396,140788
top,Order ID,USB-C Charging Cable,1,11.95,Order Date,Purchase Address
freq,355,21903,168552,21903,355,355

Checking for None Values

In [11]:
df[df.isna().any(axis='columns')] #checking NaN values

      Order ID Product Quantity Ordered Price Each Order Date Purchase Address
1          NaN     NaN              NaN        NaN        NaN              NaN
356        NaN     NaN              NaN        NaN        NaN              NaN
735        NaN     NaN              NaN        NaN        NaN              NaN
1433       NaN     NaN              NaN        NaN        NaN              NaN
1553       NaN     NaN              NaN        NaN        NaN              NaN
...        ...     ...              ...        ...        ...              ...
10012      NaN     NaN              NaN        NaN        NaN              NaN
10274      NaN     NaN              NaN        NaN        NaN              NaN
10878      NaN     NaN              NaN        NaN        NaN              NaN
11384      NaN     NaN              NaN        NaN        NaN              NaN
11662      NaN     NaN              NaN        NaN        NaN              NaN

[545 rows x 6 columns]

In [12]:
# Getting the sum of all null values in the dataset
df.isna().sum()

Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

In [13]:
percent_missing = (df.isnull().sum() / len(df) * 100).round(2)
df_missing = pd.DataFrame({'% of Missing Values' :percent_missing})
df_missing

                  % of Missing Values
Order ID                         0.29
Product                          0.29
Quantity Ordered                 0.29
Price Each                       0.29
Order Date                       0.29
Purchase Address                 0.29

Cleaning Data

In [14]:
df.dropna(axis = 0, inplace = True)

In [15]:
# check again for null values 
df.isnull().sum()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
dtype: int64

In [16]:
# We have a problem with the data that has text repetition
df['Quantity Ordered'].unique()

array(['2', '1', '3', '5', 'Quantity Ordered', '4', '7', '6', '8', '9'],
      dtype=object)

In [17]:
# Creating filter to drop text values
filter_text = df['Quantity Ordered'] != 'Quantity Ordered'

# Replacing data without text values in quantity ordered
df = df[filter_text]

In [18]:
df['Quantity Ordered'].unique()

array(['2', '1', '3', '5', '4', '7', '6', '8', '9'], dtype=object)

In [19]:
# Convert the 'Quantity Ordered' and 'Price Each' data type to numeric data type (int and float)
df['Quantity Ordered'], df['Price Each'] = df['Quantity Ordered'].astype('int64'), df['Price Each'].astype('float')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185950 entries, 0 to 11685
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  int64
 3   Price Each        185950 non-null  float64
 4   Order Date        185950 non-null  object
 5   Purchase Address  185950 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 9.9+ MB

In [20]:
# change to date-time type data
df['Order Date'] = pd.to_datetime(df['Order Date']) 
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185950 entries, 0 to 11685
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  int64
 3   Price Each        185950 non-null  float64
 4   Order Date        185950 non-null  datetime64[ns]
 5   Purchase Address  185950 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 9.9+ MB

In [21]:
# Create Year, Month, Hour, Minute Column
df['Year'] = df['Order Date'].dt.year
df['Month'] = df['Order Date'].dt.month
df['Hour'] = df['Order Date'].dt.hour
df['Minute'] = df['Order Date'].dt.minute

In [22]:
# Create Revenue Column
df['Revenue'] = df['Price Each'] * df['Quantity Ordered']

In [23]:
# Get City name from 'Purchase Address'
city = df['Purchase Address'].str.split(", ",expand=True)[1]
city

0               Dallas
2               Boston
3          Los Angeles
4          Los Angeles
5          Los Angeles
             ...
11681      Los Angeles
11682    San Francisco
11683    San Francisco
11684    San Francisco
11685    San Francisco
Name: 1, Length: 185950, dtype: object

In [24]:
# Create City Column
df['City'] = city

In [25]:
df

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Year,Month,Hour,Minute,Revenue,City
0,176558,USB-C Charging Cable,2,11.95,2019-04-19 08:46:00,"917 1st St, Dallas, TX 75001",2019,4,8,46,23.90,Dallas
2,176559,Bose SoundSport Headphones,1,99.99,2019-04-07 22:30:00,"682 Chestnut St, Boston, MA 02215",2019,4,22,30,99.99,Boston
3,176560,Google Phone,1,600.00,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",2019,4,14,38,600.00,Los Angeles
4,176560,Wired Headphones,1,11.99,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",2019,4,14,38,11.99,Los Angeles
5,176561,Wired Headphones,1,11.99,2019-04-30 09:27:00,"333 8th St, Los Angeles, CA 90001",2019,4,9,27,11.99,Los Angeles
...,...,...,...,...,...,...,...,...,...,...,...,...
11681,259353,AAA Batteries (4-pack),3,2.99,2019-09-17 20:56:00,"840 Highland St, Los Angeles, CA 90001",2019,9,20,56,8.97,Los Angeles
11682,259354,iPhone,1,700.00,2019-09-01 16:00:00,"216 Dogwood St, San Francisco, CA 94016",2019,9,16,0,700.00,San Francisco
11683,259355,iPhone,1,700.00,2019-09-23 07:39:00,"220 12th St, San Francisco, CA 94016",2019,9,7,39,700.00,San Francisco
11684,259356,34in Ultrawide Monitor,1,379.99,2019-09-19 17:30:00,"511 Forest St, San Francisco, CA 94016",2019,9,17,30,379.99,San Francisco
11685,259357,USB-C Charging Cable,1,11.95,2019-09-30 00:18:00,"250 Meadow St, San Francisco, CA 94016",2019,9,0,18,11.95,San Francisco

Q: What was the best Year for sales? How much was earned that Year?

In [26]:
df.groupby('Year').sum()[['Quantity Ordered','Price Each', 'Revenue']]

      Quantity Ordered   Price Each      Revenue
Year
2019            209038  34280627.28  34483365.68
2020                41      8503.40      8670.29

Q:What is the average sales per month?

In [27]:
df.groupby('Month').mean()[['Revenue']]

          Revenue
Month
1      187.687376
2      183.884962
3      185.250471
4      185.495390
5      190.305852
6      190.187565
7      185.249826
8      187.648849
9      180.497387
10     184.238580
11     182.074956
12     184.655913

What is the Best month for sales

In [28]:
df.groupby('Month').sum()['Revenue'].sort_values(ascending = False)

Month
12    4613443.34
10    3736726.88
4     3390670.24
11    3199603.20
5     3152606.75
3     2807100.38
7     2647775.76
6     2577802.26
8     2244467.88
2     2202022.42
9     2097560.13
1     1822256.73
Name: Revenue, dtype: float64

 What City had the highest number of sales?

In [29]:
df.groupby('City').sum()['Revenue'].sort_values(ascending = False)

City
San Francisco    8262203.91
Los Angeles      5452570.80
New York City    4664317.43
Boston           3661642.01
Atlanta          2795498.58
Dallas           2767975.40
Seattle          2747755.48
Portland         2320490.61
Austin           1819581.75
Name: Revenue, dtype: float64

What product has the hightest revenue?

In [30]:
df.groupby('Product').sum()['Revenue'].sort_values(ascending = False)

Product
Macbook Pro Laptop            8037600.00
iPhone                        4794300.00
ThinkPad Laptop               4129958.70
Google Phone                  3319200.00
27in 4K Gaming Monitor        2435097.56
34in Ultrawide Monitor        2355558.01
Apple Airpods Headphones      2349150.00
Flatscreen TV                 1445700.00
Bose SoundSport Headphones    1345565.43
27in FHD Monitor              1132424.50
Vareebadd Phone                827200.00
20in Monitor                   454148.71
LG Washing Machine             399600.00
LG Dryer                       387600.00
Lightning Charging Cable       347094.15
USB-C Charging Cable           286501.25
Wired Headphones               246478.43
AA Batteries (4-pack)          106118.40
AAA Batteries (4-pack)          92740.83
Name: Revenue, dtype: float64

What product sold the most? Why it sold the most?

In [31]:
df.groupby('Product').sum()['Quantity Ordered'].sort_values(ascending = False)

Product
AAA Batteries (4-pack)        31017
AA Batteries (4-pack)         27635
USB-C Charging Cable          23975
Lightning Charging Cable      23217
Wired Headphones              20557
Apple Airpods Headphones      15661
Bose SoundSport Headphones    13457
27in FHD Monitor               7550
iPhone                         6849
27in 4K Gaming Monitor         6244
34in Ultrawide Monitor         6199
Google Phone                   5532
Flatscreen TV                  4819
Macbook Pro Laptop             4728
ThinkPad Laptop                4130
20in Monitor                   4129
Vareebadd Phone                2068
LG Washing Machine              666
LG Dryer                        646
Name: Quantity Ordered, dtype: int64

In [32]:
df.groupby('Order ID').sum()['Quantity Ordered'].sort_values(ascending = False)

Order ID
227096    9
226483    9
211097    9
293622    8
288689    8
         ..
204970    1
204971    1
204972    1
204973    1
319670    1
Name: Quantity Ordered, Length: 178437, dtype: int64

What products are most often sold together

In [ ]:
def find_pairs (x):
    pairs = pd.DataFrame(list(permutations(x.values, 2)), columns=['A', 'B'])
    return pairs

In [ ]:
test =df.groupby('Order ID')['Product'].apply(find_pairs).reset_index(drop = True)
test

In [ ]:
test_result = test.groupby(['A', 'B']).size()
test_result

In [ ]:
df = test_result.reset_index()
df.columns = ['A', 'B', 'Size']
df.sort_values(by='Size', ascending = False, inplace = True)

In [ ]:
# clean the product row and check the head of the data
cleaned_data = df[df['A']!='Product']
cleaned_data.head()

Which market (country) generated the most sales on average?

In [ ]:
df.groupby('City').sum()['Revenue'].sort_values(ascending = False)

In [ ]:
df

When were the best- and worst-selling periods?

In [ ]:
df.groupby('Year').sum()['Revenue'].sort_values(ascending = False)

What time should we display adverstisement to maximize likelihood of customer's buying product?

In [ ]:
df.groupby(['Hour']).sum()['Quantity Ordered'].sort_values(ascending = False)

In [ ]:
# The total sales in 2019 were USD 34.483.365 with 209.038 products sold.
# May has the highest average revenue with USD 190.305852, while September has the lowest average revenue with USD 180.497387.
# December is the best month for sales with USD 4.613.443 total revenue.
# San Francisco had the highest total sales in 2019 with USD 8.259.719 total revenue.
# AAA Batteries (4-pack) are the most sold product with 31.012 products ordered.
# iPhone and Lightning Charging Cable are the most often products sold together with 1004 transactions, Google Phone and USB-C Charging Cable came second with 987 transactions.
# I recommend advertising the product before 12 PM and 7 PM, which could be at 9—11 AM and 4—6 PM.